{"layers": [{"name": "ZeroPadding2D", "custom_name": "zeropadding2d", "trainable": true, "input_shape": [38, 9, 9], "padding": [1, 1], "cache_enabled": true}, {"W_constraint": null, "b_constraint": null, "name": "Convolution2D", "custom_name": "convolution2d", "subsample": [1, 1], "activation": "linear", "trainable": true, "dim_ordering": "th", "nb_col": 5, "cache_enabled": true, "init": "glorot_uniform", "nb_filter": 32, "b_regularizer": null, "W_regularizer": null, "nb_row": 5, "activity_regularizer": null, "border_mode": "valid"}, {"cache_enabled": true, "activation": "relu", "trainable": true, "name": "Activation", "custom_name": "activation"}, {"padding": [2, 2], "cache_enabled": true, "trainable": true, "name": "ZeroPadding2D", "custom_name": "zeropadding2d"}, {"W_constraint": null, "b_constraint": null, "name": "Convolution2D", "custom_name": "convolution2d", "subsample": [1, 1], "activation": "linear", "trainable": true, "dim_ordering": "th", "nb_col": 3, "cache_enabled": true, "init": "glorot_uniform", "nb_filter": 32, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activity_regularizer": null, "border_mode": "valid"}, {"cache_enabled": true, "activation": "relu", "trainable": true, "name": "Activation", "custom_name": "activation"}, {"padding": [2, 2], "cache_enabled": true, "trainable": true, "name": "ZeroPadding2D", "custom_name": "zeropadding2d"}, {"W_constraint": null, "b_constraint": null, "name": "Convolution2D", "custom_name": "convolution2d", "subsample": [1, 1], "activation": "linear", "trainable": true, "dim_ordering": "th", "nb_col": 3, "cache_enabled": true, "init": "glorot_uniform", "nb_filter": 32, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activity_regularizer": null, "border_mode": "valid"}, {"cache_enabled": true, "activation": "relu", "trainable": true, "name": "Activation", "custom_name": "activation"}, {"padding": [2, 2], "cache_enabled": true, "trainable": true, "name": "ZeroPadding2D", "custom_name": "zeropadding2d"}, {"W_constraint": null, "b_constraint": null, "name": "Convolution2D", "custom_name": "convolution2d", "subsample": [1, 1], "activation": "linear", "trainable": true, "dim_ordering": "th", "nb_col": 3, "cache_enabled": true, "init": "glorot_uniform", "nb_filter": 32, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activity_regularizer": null, "border_mode": "valid"}, {"cache_enabled": true, "activation": "relu", "trainable": true, "name": "Activation", "custom_name": "activation"}, {"padding": [2, 2], "cache_enabled": true, "trainable": true, "name": "ZeroPadding2D", "custom_name": "zeropadding2d"}, {"W_constraint": null, "b_constraint": null, "name": "Convolution2D", "custom_name": "convolution2d", "subsample": [1, 1], "activation": "linear", "trainable": true, "dim_ordering": "th", "nb_col": 3, "cache_enabled": true, "init": "glorot_uniform", "nb_filter": 32, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activity_regularizer": null, "border_mode": "valid"}, {"cache_enabled": true, "activation": "relu", "trainable": true, "name": "Activation", "custom_name": "activation"}, {"padding": [1, 1], "cache_enabled": true, "trainable": true, "name": "ZeroPadding2D", "custom_name": "zeropadding2d"}, {"W_constraint": null, "b_constraint": null, "name": "Convolution2D", "custom_name": "convolution2d", "subsample": [1, 1], "activation": "linear", "trainable": true, "dim_ordering": "th", "nb_col": 1, "cache_enabled": true, "init": "glorot_uniform", "nb_filter": 1, "b_regularizer": null, "W_regularizer": null, "nb_row": 1, "activity_regularizer": null, "border_mode": "valid"}, {"cache_enabled": true, "activation": "relu", "trainable": true, "name": "Activation", "custom_name": "activation"}, {"cache_enabled": true, "trainable": true, "name": "Flatten", "custom_name": "flatten"}, {"W_constraint": null, "b_constraint": null, "name": "Dense", "custom_name": "dense", "activity_regularizer": null, "trainable": true, "cache_enabled": true, "init": "glorot_uniform", "activation": "linear", "input_dim": null, "b_regularizer": null, "W_regularizer": null, "output_dim": 81}, {"cache_enabled": true, "activation": "softmax", "trainable": true, "name": "Activation", "custom_name": "activation"}], "loss": "categorical_crossentropy", "optimizer": {"nesterov": false, "lr": 0.003000000026077032, "name": "SGD", "momentum": 0.0, "decay": 0.0}, "class_name": "Sequential", "sample_weight_mode": null}